posts/2015-06-19-to-america.org
#+date: <2015-06-19>
#+filetags: poetry
#+title: To America

A poem by James Weldon Johnson (June 17, 1871 – June 26, 1938), American author, educator, lawyer, diplomat, and civil rights activist.

Nine people were shot in a historic church in Charleston, South Carolina, this week, and the evidence points to it being a racist hate-crime. So, 144 years and 1 day after his birth, we are reminded that some things, unfortunately have not changed.

#+begin_quote
*America*

How would you have us, as we are?\\
Or sinking 'neath the load we bear?\\
Our eyes fixed forward on a star?\\
Or gazing empty at despair?

Rising or falling? Men or things?\\
With dragging pace or footsteps fleet?\\
Strong, willing sinews in your wings?\\
Or tightening chains about your feet?
#+end_quote

#+ATTR_HTML: :class source
From /Fifty Years & Other Poems/ (1917)
