docs/posts/2015-06-19-to-america.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>To America</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">To America</h1>
<p class="subtitle" role="doc-subtitle">Jun 19, 2015</p>
</header><p>
A poem by James Weldon Johnson (June 17, 1871 – June 26, 1938), American author, educator, lawyer, diplomat, and civil rights activist.
</p>

<p>
Nine people were shot in a historic church in Charleston, South Carolina, this week, and the evidence points to it being a racist hate-crime. So, 144 years and 1 day after his birth, we are reminded that some things, unfortunately have not changed.
</p>

<blockquote>
<p>
<b>America</b>
</p>

<p>
How would you have us, as we are?<br>
Or sinking &rsquo;neath the load we bear?<br>
Our eyes fixed forward on a star?<br>
Or gazing empty at despair?
</p>

<p>
Rising or falling? Men or things?<br>
With dragging pace or footsteps fleet?<br>
Strong, willing sinews in your wings?<br>
Or tightening chains about your feet?
</p>
</blockquote>

<p class="source">
From <i>Fifty Years &amp; Other Poems</i> (1917)
</p>


<div class="tagline" id="org029fde6">
<p>
Tagged: <a href="../tags/poetry.html">Poetry</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
